necessary_columns = {
    "acrta": [
        "TA001",  # 結帳單別
        "TA002",  # 結帳單號
        "TA003",  # 結帳日期
        "TA004",  # 客戶代號
        "TA005",  # 收款業務員
        "TA009",  # 幣別
        "TA010",  # 匯率
        "TA015",  # 發票號碼(訖)
        "TA025",  # 確認碼
        "TA027",  # 結案碼
        "TA029",  # 應收金額
        "TA030",  # 營業稅額
        "TA036",  # INVOICE_NO
        "TA041",  # 本幣應收金額
        "TA042",  # 本幣營業稅額
        "TA058",  # 本幣已收金額
    ],
    "copma": [
        "MA001",  # 客戶代號
        "MA002",  # 客戶簡稱
    ],
    # "dscma": [
    #     "MA001",  # 登入者代號
    #     "MA002",  # 登入者名稱
    # ],
    "acrtb": [
        "TB001",  # 結帳單別
        "TB002",  # 結帳單號
        "TB005",  # 憑證單別
        "TB006",  # 憑證單號
        "TB007",  # 憑證序號
        # "TB008",  # 憑證日期
    ],
    "acrtc": [
        "TC001",  # 收款單別
        "TC002",  # 收款單號
        "TC003",  # 收款日期
        "TC004",  # 客戶代號
        "TC005",  # 幣別
        "TC008",  # 確認碼
        "TC011",  # 原幣借方金額
    ],
}

change_columns = {
    "acrta": [
        ('客戶代號', '客戶代號'),
        ('客戶名稱', '客戶簡稱'),
        ('日期', '結帳日期'),
        # ('結帳單號', '結帳單號'),
        ('業務員代號', '收款業務員'),
        ('發票號碼', '發票號碼(訖)'),
        ('幣別', '幣別'),
        # ('原幣應收帳款', '原幣應收帳款'),
        # ('原幣未收帳款', '原幣未收帳款'),
        ('匯率', '匯率'),
        # ('憑證號碼', '憑證號碼'),
    ],
    "acrtc": [
        ('客戶代號', '客戶代號'),
        ('客戶名稱', '客戶簡稱'),
        ('收款日期', '收款日期'),
        ('幣別', '幣別'),
        ('原幣金額', '原幣借方金額'),
    ]
}

ignore_record = [
    ('USD', 10000),
    ('EUR', 9500),
    ('NTD', 300000),
]

to_list_official = [
    'carol.chen@automodules.com',
    'sabrina.chou@automodules.com',
    'vivian.chen@automodules.com',
]
cc_list_official = [
    'kenji.huang@automodules.com',
    'ysuper.liang@automodules.com',
]
